[
  {
    "title": "SDE Game Developer",
    "company": "Prudent Gaming, Bengaluru",
    "duration": "Oct 2023 - Present",
    "location": "Remote",
    "responsibilities": [
      "Developed a casino-themed web app using Flutter, ensuring smooth gameplay on Android, iOS, and web platforms.",
      "Designed and implemented scalable backend services for campaign management, payment processing, and slot reel generation.",
      "Built a dynamic slot reel generator that creates game boards based on configurable parameters, ensuring randomness and fairness.",
      "Developed APIs for handling user authentication, wallet transactions, and gameplay logic using Golang and MongoDB.",
      "Integrated PayU payment gateway with MongoDB for real-time transaction tracking and secure in-app purchases.",
      "Implemented a robust campaign management system that allows scheduling, winner selection, updates, and real-time notifications.",
      "Utilized Kafka for event-driven architecture, ensuring smooth data flow and system reliability across microservices.",
      "Optimized WebSocket-based real-time communication for multiplayer game interactions and live updates."
    ]
  },
  {
    "title": "Flutter Developer",
    "company": "NextGen Samvaad, Varanasi",
    "duration": "Jan 2023 - Sep 2023",
    "location": "Onsite",
    "responsibilities": [
      "Developed a feature-rich e-commerce platform with integrated social media functionalities to enhance user engagement and interaction.",
      "Implemented a QR code scanner app for seamless user reviews, ratings, and merchant verification, along with dynamic QR code generation for businesses.",
      "Designed and optimized intuitive UI/UX components, ensuring a responsive and visually appealing experience across Android and iOS devices.",
      "Utilized Provider, Bloc, and GetX for efficient state management, improving app performance and maintainability.",
      "Implemented push notifications, chat features, and real-time updates to enhance user retention and engagement.",
      "Optimized API calls and database interactions to reduce latency and improve app efficiency.",
      "Collaborated with backend developers to design RESTful APIs, ensuring smooth data flow and functionality."
    ]
  },
  {
    "title": "Junior Database Administrator",
    "company": "Cashpor India, Varanasi",
    "duration": "Sep 2022 - Dec 2022",
    "location": "Onsite",
    "responsibilities": [
      "Managed and maintained SQL databases, ensuring data integrity and optimal performance.",
      "Diagnosed and resolved database-related issues efficiently."
    ]
  },
  {
    "title": "Freelance Experience",
    "company": "Melooha (Astrology App)",
    "duration": "N/A",
    "location": "Remote",
    "responsibilities": [
      "Contributed to the development of multiple app pages using Flutter.",
      "Implemented UI components and optimized performance for a seamless user experience.",
      "Ensured cross-platform compatibility for Android and iOS."
    ]
  }
]